app/views/admin/items/edit.html.erb

SELECT "genres".* FROM "genres"
---
    <%= f.label :ジャンル, class: "col-md-5 text-center col-form-label" %>
  <%= f.collection_select(:genre_id, Genre.all, :id, :name) %>