app/controllers/admin/genres_controller.rb

def create
  @genre = Genre.new(genre_params)
  if @genre.save
    redirect_to admin_genres_path
  else
    @genres = Genre.all
---
INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "ケーキ"], ["created_at", "2021-10-24 04:45:04.329938"], ["updated_at", "2021-10-24 04:45:04.329938"]]
SELECT "genres".* FROM "genres"

def update
  @genre = Genre.find(params[:id])
  if @genre.update(genre_params)
---
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "genres" SET "name" = ?, "updated_at" = ? WHERE "genres"."id" = ?  [["name", "キャンデ"], ["updated_at", "2021-10-27 13:09:21.079669"], ["id", 4]]