app/controllers/admin/items_controller.rb

INSERT INTO "items" ("name", "image_id", "introduction", "price", "is_active", "created_at", "updated_at", "genre_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @item = Item.new(item_params)
    if @item.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "items" SET "image_id" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["image_id", "d71778de5503e0eb8c4ada3b34ff2f80579028176ab5a90452292f35cf87"], ["updated_at", "2021-10-31 12:29:46.483266"], ["id", 10]]
---
  def update
    @item = Item.find(params[:id])
    if @item.update(item_params)