app/controllers/admin/orders_controller.rb

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "orders" SET "status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["status", 1], ["updated_at", "2021-10-30 10:10:22.776106"], ["id", 1]]
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]
UPDATE "order_details" SET "making_status" = ?, "updated_at" = ? WHERE "order_details"."id" = ?  [["making_status", 1], ["updated_at", "2021-10-30 11:15:05.138468"], ["id", 1]]
---
  def update
    @order = Order.find(params[:id])
    @order.update(order_params)
    if Order.statuses[@order.status] == 1
      @order_details = @order.order_details
      @order_details.each do |order_detail|
        order_detail.update(making_status: 1)