app/controllers/admin/order_details_controller.rb

SELECT  "order_details".* FROM "order_details" WHERE "order_details"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "orders" SET "status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["status", 2], ["updated_at", "2021-10-30 11:28:53.847587"], ["id", 1]]
UPDATE "order_details" SET "making_status" = ?, "updated_at" = ? WHERE "order_details"."id" = ?  [["making_status", 2], ["updated_at", "2021-10-30 11:28:53.837131"], ["id", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "order_details"."making_status" FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]
UPDATE "orders" SET "status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["status", 3], ["updated_at", "2021-10-30 11:32:08.992417"], ["id", 1]]
---
  def update
    @order_detail = OrderDetail.find(params[:id])
    @order_detail.update(order_detail_params)
    @order = @order_detail.order
    if @order_detail.making_status == "making"
       @order.update(status: 2)
    elsif @order.order_details.pluck(:making_status).all? {|making_status| making_status == "complete"}
       @order = @order_detail.order
       @order.update(status: 3)