app/views/admin/orders/show.html.erb

<h4>購入者</h4>
<%= @order.customer.last_name %> <%= @order.customer.first_name %>
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

          <td>
           <%= order.order_detail.item.name %>
---
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

          <td>
           <%= order.order_detail.price %>
---
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]

          <td>
            <%= order.order_detail.making_status %>
---
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 2]]