app/views/admin/homes/top.html.erb

          <td>
           <%= order.order_detail.amount %>
---
SELECT "orders".* FROM "orders"