app/controllers/public/addresses_controller.rb

INSERT INTO "addresses" ("name", "postal_code", "address", "updated_at", "customer_id", "created_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "山本花子"], ["postal_code", "111111"], ["address", "大阪府"], ["updated_at", "2021-10-24 04:22:38.736164"], ["customer_id", 1], ["created_at", "2021-10-24 04:22:38.736164"]]
---
  def create
    @address = Address.new(address_params)
    @address.customer_id = current_customer.id
    @address.save

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "addresses" SET "postal_code" = ?, "updated_at" = ? WHERE "addresses"."id" = ?  [["postal_code", "1111111"], ["updated_at", "2021-10-24 07:27:41.675092"], ["id", 1]]
---
  def update
    @address = Address.find(params[:id])
    @address.update(address_params)