app/controllers/public/cart_items_controller.rb

  def update
    @cart_item = CartItem.find(params[:id])
    if @cart_item.update(cart_item_params)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "cart_items" SET "amount" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["amount", 2], ["updated_at", "2021-10-31 05:40:29.568859"], ["id", 10]]

  def destroy
    @cart_item = CartItem.find(params[:id])
    @cart_item.destroy
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 13]]

  def destroy_all
    @customer = current_customer
    @customer.cart_items.destroy_all
---
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 10]]

  def create
    @cart_item = CartItem.new(cart_item_params)
    @cart_item.customer_id = current_customer.id
    @cart_items = current_customer.cart_items
    @cart_items.each do |cart_item|
    if cart_item.item_id == @cart_item.item_id
      new_amount = cart_item.amount + @cart_item.amount
      cart_item.update_attributes(amount: new_amount)
      @cart_item.delete
    end
    end
    if @cart_item.save
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 6]]
INSERT INTO "cart_items" ("amount", "created_at", "updated_at", "item_id", "customer_id") VALUES (?, ?, ?, ?, ?)  [["amount", 2], ["created_at", "2021-10-31 05:35:32.362023"], ["updated_at", "2021-10-31 05:35:32.362023"], ["item_id", 5], ["customer_id", 6]]