app/controllers/public/customers_controller.rb

UPDATE "customers" SET "last_name" = ?, "first_name" = ?, "last_name_kana" = ?, "first_name_kana" = ?, "email" = ?, "postal_code" = ?, "address" = ?, "telephone_number" = ?, "updated_at" = ? WHERE "customers"."id" = ?
---
  def update
    @customer = current_customer
    if @customer.update(customer_params)

UPDATE "customers" SET "is_active" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["is_active", 0], ["updated_at", "2021-10-31 06:29:02.573018"], ["id", 6]]
---
  def withdraw
    @customer = current_customer
    @customer.update(is_active: false)