app/controllers/public/homes_controller.rb

SELECT "genres".* FROM "genres"
SELECT  "items".* FROM "items" ORDER BY "items"."id" DESC LIMIT ?  [["LIMIT", 4]]
---
  def top
    @genres = Genre.all
    @items = Item.last(4)