app/controllers/public/items_controller.rb

SELECT "items".* FROM "items" WHERE (name LIKE '%ケーキ%')
SELECT "genres".* FROM "genres"
---
  def index
    @items = Item.all
    @genres = Genre.all

SELECT "genres".* FROM "genres"
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def surch
    @genres = Genre.all
    @genre = Genre.find(params[:id])

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "genres".* FROM "genres"
---
  def show
    @item = Item.find(params[:id])
    @cart_item = CartItem.new
    @genres = Genre.all