app/controllers/public/items_controller.rb

SELECT "genres".* FROM "genres"
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def genre
    @genres = Genre.all
    @genre = Genre.find(params[:id])