app/controllers/public/orders_controller.rb

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def confirm
    @customer = current_customer
    @cart_items = @customer.cart_items
    @sum = 0
    @order = Order.new(order_params)
    if params[:order][:select_address] == "0"
      @order.postal_code = current_customer.postal_code
      @order.address = current_customer.address
      @order.name = current_customer.last_name + current_customer.first_name
    elsif params[:order][:select_address] == "1"
      @address = Address.find(params[:order][:address_id])

INSERT INTO "orders" ("created_at", "updated_at", "customer_id") VALUES (?, ?, ?)  [["created_at", "2021-10-25 09:00:48.206165"], ["updated_at", "2021-10-25 09:00:48.206165"], ["customer_id", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 1]]
INSERT INTO "order_details" ("price", "amount", "created_at", "updated_at", "item_id", "order_id") VALUES (?, ?, ?, ?, ?, ?)  [["price", 660], ["amount", 2], ["created_at", "2021-10-25 10:51:10.857619"], ["updated_at", "2021-10-25 10:51:10.857619"], ["item_id", 1], ["order_id", 6]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 5]]
---
  def create
    @order = Order.new(order_params)
    @order.customer_id = current_customer.id
    @order.save
    @customer = current_customer
    @cart_items = @customer.cart_items
    @cart_items.each do |cart_item|
      @order_detail = OrderDetail.new
      @order_detail.item_id = cart_item.item_id
      @order_detail.order_id = @order.id
      @order_detail.amount = cart_item.amount
      @order_detail.price = cart_item.subtotal
      @order_detail.save
    end
    @cart_items.destroy_all

SELECT "orders".* FROM "orders" WHERE "orders"."customer_id" = ?  [["customer_id", 1]]
---
  def index
    @customer = current_customer
    @orders = @customer.orders

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 7]]
---
  def show
    @order = Order.find(params[:id])
    @order_details = @order.order_details