app/controllers/public/sessions_controller.rb

SELECT  "customers".* FROM "customers" WHERE "customers"."email" = ? LIMIT ?  [["email", "b@b"], ["LIMIT", 1]]
---
  def reject_inactive_customer
    @customer = Customer.find_by(email: params[:customer][:email])