app/views/public/items/genre.html.erb

      <h4>
        <strong><%= @genre.name %>ジャンル一覧</strong> (全<%= @genre.items.count %>件)
---
SELECT "items".* FROM "items" WHERE "items"."genre_id" = ?  [["genre_id", 1]]
SELECT COUNT(*) FROM "items" WHERE "items"."genre_id" = ?  [["genre_id", 1]]

      <div class="row mt-5">
          <% @genre.items.each do |item| %>
---
SELECT "items".* FROM "items" WHERE "items"."genre_id" = ?  [["genre_id", 1]]